Identifier: com.github.jc0b.download.JASP
Description: "Downloads the latest version of JASP"
MinimumVersion: "2.3"

Input:
  DOWNLOAD_URL: "https://jasp-stats.org/thank-you-for-downloading-jasp-macos/"

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: ://static.jasp-stats.org/(JASP-[\d\.]+(-?\w*)*).dmg
      url: "%DOWNLOAD_URL%"

  - Processor: URLDownloader
    Arguments:
      filename: "%match%.dmg"
      url: "https://static.jasp-stats.org/%match%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/JASP.app"
      requirement: identifier "org.jasp-stats.jasp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = AWJJ3YVK9B