Description: Gets the latest version of fleetctl, and creates an installer pkg.
Identifier: com.github.jc0b.pkg.fleetctl
MinimumVersion: "2.3"

Input:
  NAME: fleetctl
  PKGID: com.fleetdm.fleetctl

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: fleetdm/fleet
      asset_regex: fleetctl_v.*_macos.zip

  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: \d+\.\d{1,2}\.\d{1,2}
      text_in: "%version%"
      result_output_var_name: "version"

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: true

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: "0755"
        usr/local: "0755"
        usr/local/bin: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/pkg_root"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/%NAME%/%NAME%_v%version%_macos/fleetctl"
      destination_path: "%RECIPE_CACHE_DIR%/pkg_root/usr/local/bin/fleetctl"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: "wheel"
            path: "/usr/local/bin/%NAME%"
            user: "root"
            mode: "0755"
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "%PKGID%"
        options: "purge_ds_store"
        pkgdir: "%RECIPE_CACHE_DIR%"