<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Docker, converts it into a .pkg, and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jc0b.munki.Docker</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>Docker</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Docker for Mac is an easy-to-install desktop app for building, debugging and testing containerised apps on a Mac.</string>
            <key>developer</key>
            <string>Docker Inc</string>
            <key>display_name</key>
            <string>Docker</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>postinstall_script</key>
            <string>#!/bin/bash

if [ ! -e /Applications/Docker.app ]
then
	/bin/echo "WARNING: Docker is not installed, exiting..."
	exit 1
fi

/bin/echo "Installing/updating Docker privileged components..."
/Applications/Docker.app/Contents/MacOS/Docker --install-privileged-components
</string>
            <key>postuninstall_script</key>
            <string>#!/bin/bash
#
# This script just reverses the postinstall operations
#

# Unload networking
# (use -F to force this; there are probably better ways to do this
# but this margin isn't big enough ...)
/bin/launchctl unload -F /Library/LaunchDaemons/com.docker.vmnetd.plist

rm -f /Library/LaunchDaemons/com.docker.vmnetd.plist
rm -f /Library/PrivilegedHelperTools/com.docker.vmnetd
rm -f /var/tmp/com.docker.vmnetd.socket

for tool in docker docker-compose docker-diagnose docker-machine notary; do
    rm -f /usr/local/bin/${tool}
done
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.smithjw.pkg.Docker</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
