Description: Downloads the latest version of Sublime Text 4.
Identifier: com.github.jc0b.download.SublimeText4
MinimumVersion: "2.3"

Input:
  NAME: SublimeText
  DL_PAGE_URL: https://www.sublimetext.com/download_thanks

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: https://download.sublimetext.com/sublime_text_build_\d*_mac.zip
    result_output_var_name: download_url
    url: '%DL_PAGE_URL%'

- Processor: URLDownloader
  Arguments:
    url: "%download_url%"

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unarchived'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%destination_path%/Sublime Text.app'
    requirement: anchor apple generic and identifier "com.sublimetext.4" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Z6D26JE4Y4

- Processor: PlistReader
  Arguments:
    info_path: "%destination_path%/Sublime Text.app"
    plist_keys:
      CFBundleIdentifier: bundleid
      CFBundleVersion: version