Description: Packages the latest version of Sublime Text 4.
Identifier: com.github.jc0b.pkg.SublimeText4
MinimumVersion: "2.3"
ParentRecipe: com.github.jc0b.download.SublimeText4

Input:
  NAME: SublimeText

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/unarchived/Sublime Text.app'
      destination_path: '%pkgroot%/Applications/Sublime Text.app'
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%bundleid%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'