Description: Downloads the latest release of LowProfile from GitHub releases.
Identifier: com.github.jc0b.download.LowProfile

Input:
  NAME: LowProfile

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: ninxsoft/LowProfile
      asset_regex: Low.Profile..*.pkg

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Nindi Gill (7K3HVCLV7Z)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"
      input_path: "%pathname%"