<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Apparency application and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jc0b.munki.Apparency</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Apparency</string>
		<key>repo_subdirectory</key>
		<string>apps/mothersruin</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>Apparency</string>
			<key>description</key>
			<string>Apparency: The App That Opens Apps</string>
			<key>minimum_os_version</key>
			<string>10.14</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.2</string>
	<key>ParentRecipe</key>
	<string>com.github.jc0b.download.Apparency</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
